---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GeometryCreationUtilities..::..CreateRevolvedGeometry Method
GeometryCreationUtilities Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateRevolvedGeometry(Frame, IList<(Of <<'(CurveLoop>)>>), Double, Double) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |
|  | CreateRevolvedGeometry(Frame, IList<(Of <<'(CurveLoop>)>>), Double, Double, SolidOptions) | Creates a solid of revolution by revolving a set of closed curve loops around an axis by a specified angle. |

# See Also

GeometryCreationUtilities Class

GeometryCreationUtilities Members

Autodesk.Revit.DB Namespace